input_openfoam/tutorials/multiphase/overInterDyMFoam/boatAndPropeller/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    overset1
    {
        type            overset;
        value           uniform 0;
    }
    overset2
    {
        type            overset;
        value           uniform 0;
    }
    overset3
    {
        type            overset;
        value           uniform 0;
    }
    hullWall
    {
        type            zeroGradient;
    }
    propellerWall
    {
        type            zeroGradient;
    }
    rudderWall
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
